ajohnson-smarthome/AJMiddleCar/firmware/s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# The USB device class. NCM rather than ECM or RNDIS because it is the one both
# macOS and iOS are expected to accept class-compliant, and the only mode IDF's
# tusb_ncm example is built around.
CONFIG_TINYUSB_NET_MODE_NCM=y

# Console on UART0, reached through the board's second Type-C and its bridge chip.
#
# This is forced, not preferred: on ESP32-S3 the native USB pins (GPIO19/20) are muxed
# between the USB-Serial-JTAG controller and the USB-OTG controller, and only one may
# have them. TinyUSB needs USB-OTG, so the moment NCM comes up the USB console would
# disappear mid-session. Putting the console on UART0 from the start means logs never
# move.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n

# 16 MB flash with a custom table: two 4 MB OTA slots, plus a reserved data partition.
# The slots predate the OTA code by two plans — see partitions.csv for why the table is the half
# that gets decided first.
#
# Rollback is on. An image written through POST /ota boots once as PENDING_VERIFY and is reverted
# by the bootloader unless it cancels that itself; main.c cancels it at the end of app_main, after
# the HTTP server that could deliver a replacement is answering. The property this protects is
# reachability — a dongle lives in a pocket, and an image that boots but cannot serve /ota is one
# that needs a cable and a laptop to undo.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# N16R8: 16 MB flash, 8 MB PSRAM on an octal bus. Octal PSRAM occupies GPIO33-37 —
# nothing here needs them, but note it before assigning pins.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# The S3 has its own radio — unlike the P4, which has none and drives a C6 over SDIO. Nothing
# here is a co-processor; esp_wifi talks to silicon on the same die.
#
# Station only. The dongle never becomes an AP: the phone reaches it over USB, and a softAP
# would be a second radio interface for the API guard to worry about and for nobody to use.
# Disabling SoftAP support is what makes that structural rather than just a promise wifi_sta.c
# happens to keep — esp_wifi_set_mode(WIFI_MODE_STA) alone doesn't remove the AP code, this does.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
#
# Dynamic TX buffers, stated the only way that actually takes. This line used to read
# CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1, which is a silent no-op: that symbol has no prompt and is
# derived (esp_wifi/Kconfig) from the promptable choice below it —
#   config ESP_WIFI_TX_BUFFER_TYPE
#       int
#       default 0 if ESP_WIFI_STATIC_TX_BUFFER
#       default 1 if ESP_WIFI_DYNAMIC_TX_BUFFER
# — so kconfiglib recomputes it from the choice and discards whatever was written here,
# without a warning. Setting it to 0 produced 1 all the same. The value was right only by
# coincidence with the choice's own unforced default (ESP_WIFI_DYNAMIC_TX_BUFFER), which a
# later IDF is free to move.
#
# Dynamic and not static, with a caveat worth knowing: the choice's help says "If PSRAM is
# enabled, 'Static' should be selected to guarantee enough WiFi TX buffers", and PSRAM is
# enabled here. Dynamic is kept because it is what this firmware has been built and bench-run
# with, and because the dongle's Wi-Fi carries relayed REST and a 10 Hz control stream rather
# than the sustained bulk TX that advice is aimed at. If TX buffer exhaustion is ever seen on
# hardware, CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y plus a STATIC_TX_BUFFER_NUM is the first thing
# to try — and now it will actually take effect.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# The relays forward between two interfaces, so lwIP must be willing to hold more sockets than
# a single-purpose device needs. Worst-case budget, one line per consumer:
#
#   httpd (status_api.c, :8080): 3 internal sockets + max_open_sockets(3, lowered from
#     esp_http_server's default of 7 in status_api.c, since this is an admin API, not proxied
#     REST traffic) = 6. Three, not two: httpd_start's own comment enumerates listen_fd, the
#     UDP socket it SENDS control messages on (msg_fd) and the one it RECEIVES them on
#     (ctrl_fd), and states "the total number of required sockets is max_open_sockets + 3".
#     It enforces that too — httpd_start returns ESP_ERR_INVALID_ARG when
#     CONFIG_LWIP_MAX_SOCKETS is smaller.
#   relay_udp.c (:4210): 1 phone-facing socket + UDP_SESS_MAX(4) car-facing sockets = 5
#   relay_tcp.c (:80): 1 listener + RELAY_POOL_SIZE(4) slots x 2 sockets each
#     (phone_sock + car_sock, held whether a slot is SLOT_CONNECTING or SLOT_ACTIVE) = 9
#
# Steady-state worst case: 6 + 5 + 9 = 20, so 24 leaves 4 sockets of headroom. The true
# instantaneous peak is 21: relay_tcp's handle_accept accepts a connection BEFORE it looks for
# a free slot, so with the pool already full it briefly holds a twenty-first socket between
# accept() and the close() that refuses it. That is deliberate — refusing a full pool by
# closing beats hanging a client on an unaccepted connection — and 24 covers it. Cheap to raise
# again if any of the three consumers above grows. (Before task-5's review this value was 16,
# four short of the 20 above and five short of the peak; an earlier version of this comment put
# that shortfall at seven, which was wrong twice over.)
CONFIG_LWIP_MAX_SOCKETS=24
